{"index":{"title":"Research notes","links":["blog/","symmetry_analysis/Correspondence-between-two-notions-of-symmetries-of-evolution-equations","symmetry_analysis/","projects/article_symmetry_analysis","machine_learning/","numerical_analysis/","partial_differential_equations/","probability_and_stochastics/"],"tags":[],"content":"Welcome to my page dedicated to archiving my research notes!\nThese notes range from insightful remarks on selected topics or results, to shorter snippets of theorems, definitions, conventions, and so on that might be of interest when defocused from a specific context. Some of these notes are meant to be a supplement to the blog – more like auxiliary appendices to the contents of the blog posts.\nOf course, some of these notes are written entirely for my own learning. Regardless of the context in which the notes are being written, either for research or learning, I try to be as insightful and astute as possible so as to heighten the overall standard of the notes. The upshot of this might be that some of the notes might be overly technical or advanced, but, in fairness, the notes are primarily written for my own usage.\n SELECTED WRITING\n\nCorrespondence between two notions of symmetries of evolution equations\n\n CATEGORIES\n\n    \n     Lie Symmetry Analysis\n     Notes primarily from  Applications of Lie Groups to Differential Equations  by Peter J. Olver and related articles on similar topics, related to my research project entitled  Symmetry Analysis on Nonlocal Equations.\n    \n    \n     Machine Learning\n     I occasionally enjoy reading about what mathematics and algorithms encompass the world of machine learning and neural networks. \n    \n    \n     Numerical Analysis\n     Numerical algorithms and notes from self-studying topics in applied mathematics. \n    \n    \n     Partial Differential Equations\n     Remarks, theorems and notes on papers that relate to my main field of expertise. \n    \n    \n     Probability and Stochastics\n     Self-study notes from Çınlar&#039;s book  Probability and Stochastics, in addition to smatterings of data analysis and statistics.\n    \n\n ABOUT QUARTZ\nThis page and corresponding subpages are made using Quartz 4.0 by Jacky Zhao, which transforms markdown files into static webpages. My personal workflow utilizes Obsidian and Visual Studio Code to manage and write the markdown files themselves, which are then pushed into a GitHub repo of Quartz to be rebuilt and updated locally."},"machine_learning/index":{"title":"Machine Learning","links":[],"tags":[],"content":""},"numerical_analysis/index":{"title":"Numerical Analysis","links":[],"tags":[],"content":""},"partial_differential_equations/index":{"title":"Partial Differential Equations","links":[],"tags":[],"content":""},"probability_and_stochastics/data_analysis/index":{"title":"Data Analysis","links":[],"tags":[],"content":""},"probability_and_stochastics/index":{"title":"Probability and Stochastics","links":[],"tags":[],"content":""},"symmetry_analysis/Correspondence-between-two-notions-of-symmetries-of-evolution-equations":{"title":"Correspondence between two notions of symmetries of evolution equations","links":[],"tags":["symmetries"],"content":"Consider the evolution equation given by\nut​=K\nwhere u=(u1,…,uq) are the dependent functions and K=(K1[u],…,Kq[u]) may depend on the partial derivatives uJα​=∂J​uα and x=(x1,…,xp), but is independent in time. In Rosencrans 1 the following symmetry definition is used:\n\n\n                  \n                  Definition \n                  \n                \nA symmetry of the evolution equation ut​=K is another equation us​=P such that\nDt​P=Ds​K\nwhich is the necessary and sufficient condition for u to be a simultaneous solution for both systems.\n\nFrom Olver 2, the condition for vP​ generating a symmetry is\n∂t∂vP​​+[vP​,vK​]=0\nwhere vK​ is the evolutionary vector field associated with K:\nvK​=α=1∑q​Kα[u]∂uα∂​,\nlikewise for vP​.\nWe shall see how these two different formalisms are linked.\nStarting from Rosencrans’ formalism, let vP​ denote the evolutionary vector field associated with P. Then\nDt​P=∂t∂P​+α,J∑​∂uJα​∂P​∂t∂uJα​​=∂t∂P​+α,J∑​∂uJα​∂P​∂J​Kα\nand similarly, noting that K is independent of s,\nDs​K=∂s∂K​+α,J∑​∂uJα​∂K​∂s∂uJα​​=α,J∑​∂uJα​∂K​∂J​Pα.\nSince Dt​P=Ds​K we then obtain\n∂t∂P​=α,J∑​∂uJα​∂K​∂J​Pα−α,J∑​∂uJα​∂P​∂J​Kα.(1)\n\nRosencrans’ article actually has a vectorialization of q-tupled functions P=(P1,…,Pq) which associates an operator V(P) to P through\nV(P)=J∑​∂J​P⋅∂J​=α,J∑​∂J​Pα⋅∂Jα​.\nUsing this vectorialization, Equation(1) then reads\n∂t∂P​=V(P)K−V(K)P.(2)\n\nNow, P is a q-tuple with components Pα, hence it is also identifiable with its evolutionary vector field vP​. We can think of this identification as expanding P over the basis {∂uα​}. Equation (2) finally becomes the desired symmetry notion from Olver’s text:\n∂t∂vP​​+[vP​,vK​]=0\nsince one can do the aforementioned identification on the summands involving the partials of K and P as well.\nFootnotes\n\n\nS. Rosencrans. “Conservation laws generated by pairs of non-Hamiltonian symmetries,” in Journal of Differential Equations, vol. 43, no. 3, pp. 305–322, 1982. ↩\n\n\nP. Olver, Applications of Lie Groups to Differential Equations. Springer New York, 1993. ↩\n\n\n"},"symmetry_analysis/index":{"title":"Lie Symmetry Analysis","links":[],"tags":[],"content":""},"programming/index":{"title":"Programming","links":[],"tags":[],"content":""},"programming/Misc./index":{"title":"Misc.","links":[],"tags":[],"content":""}}